Tekla Open API Reference for Tekla Structures 2025
AlongLinePlacing Methods
The AlongLinePlacing type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PlacingBase.IsEqual(Object).)
Top
See Also
Reference
AlongLinePlacing Class
Tekla.Structures.Drawing Namespace